content/posts/Du_Phan's_implementation_of_Statistical_rethinking_in_pyro.md
+++
title = "Du Phan's implementation of Statistical rethinking in pyro"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:17-04:00
slug = "Du_Phan's_implementation_of_Statistical_rethinking_in_pyro"
draft = false
+++

## [Du Phan]({{< relref "Du_Phan" >}}), [pyro]({{< relref "pyro" >}}), [Statistical rethinking by Richard McElreath in 2020]({{< relref "Statistical_rethinking_by_Richard_McElreath_in_2020" >}}), [variational inference]({{< relref "variational_inference" >}}), [probabilistic inference]({{< relref "probabilistic_inference" >}}) {#du-phan--du-phan-dot-md--pyro--pyro-dot-md--statistical-rethinking-by-richard-mcelreath-in-2020--statistical-rethinking-by-richard-mcelreath-in-2020-dot-md--variational-inference--variational-inference-dot-md--probabilistic-inference--probabilistic-inference-dot-md}


## [Du Phan]({{< relref "Du_Phan" >}})'s [implementation of Statistical rethinking in pyro](<https://fehiepsi.github.io/rethinking-numpyro/>) {#du-phan--du-phan-dot-md--s-implementation-of-statistical-rethinking-in-pyro--https-fehiepsi-dot-github-dot-io-rethinking-numpyro}


### compare to the [analogous pymc3 implementation](<https://github.com/pymc-devs/resources/tree/master/Rethinking>) {#compare-to-the-analogous-pymc3-implementation--https-github-dot-com-pymc-devs-resources-tree-master-rethinking}


## [Preface](<https://fehiepsi.github.io/rethinking-numpyro/00-preface.html>) {#preface--https-fehiepsi-dot-github-dot-io-rethinking-numpyro-00-preface-dot-html}


## [Chapter 1. The Golem of Prague](<https://fehiepsi.github.io/rethinking-numpyro/01-the-golem-of-prague.html>) {#chapter-1-dot-the-golem-of-prague--https-fehiepsi-dot-github-dot-io-rethinking-numpyro-01-the-golem-of-prague-dot-html}


## [Chapter 2. Small Worlds and Large Worlds](<https://fehiepsi.github.io/rethinking-numpyro/02-small-worlds-and-large-worlds.html>) [progress indicators]({{< relref "progress_indicators" >}}) {#chapter-2-dot-small-worlds-and-large-worlds--https-fehiepsi-dot-github-dot-io-rethinking-numpyro-02-small-worlds-and-large-worlds-dot-html--progress-indicators--progress-indicators-dot-md}


## [Chapter 3. Sampling the Imaginary](<https://fehiepsi.github.io/rethinking-numpyro/03-sampling-the-imaginary.html>) {#chapter-3-dot-sampling-the-imaginary--https-fehiepsi-dot-github-dot-io-rethinking-numpyro-03-sampling-the-imaginary-dot-html}


## [Chapter 4. Geocentric Models](<https://fehiepsi.github.io/rethinking-numpyro/04-geocentric-models.html>) {#chapter-4-dot-geocentric-models--https-fehiepsi-dot-github-dot-io-rethinking-numpyro-04-geocentric-models-dot-html}


## [Chapter 5. The Many Variables & The Spurious Waffles](<https://fehiepsi.github.io/rethinking-numpyro/05-the-many-variables-and-the-spurious-waffles.html>) {#chapter-5-dot-the-many-variables-and-the-spurious-waffles--https-fehiepsi-dot-github-dot-io-rethinking-numpyro-05-the-many-variables-and-the-spurious-waffles-dot-html}


## [Chapter 6. The Haunted DAG & The Causal Terror](<https://fehiepsi.github.io/rethinking-numpyro/06-the-haunted-dag-and-the-causal-terror.html>) {#chapter-6-dot-the-haunted-dag-and-the-causal-terror--https-fehiepsi-dot-github-dot-io-rethinking-numpyro-06-the-haunted-dag-and-the-causal-terror-dot-html}


## [Chapter 7. Ulysses’ Compass](<https://fehiepsi.github.io/rethinking-numpyro/07-ulysses-compass.html>) {#chapter-7-dot-ulysses-compass--https-fehiepsi-dot-github-dot-io-rethinking-numpyro-07-ulysses-compass-dot-html}


## [Chapter 8. Conditional Manatees](<https://fehiepsi.github.io/rethinking-numpyro/08-conditional-manatees.html>) {#chapter-8-dot-conditional-manatees--https-fehiepsi-dot-github-dot-io-rethinking-numpyro-08-conditional-manatees-dot-html}


## [Chapter 9. Markov Chain Monte Carlo](<https://fehiepsi.github.io/rethinking-numpyro/09-markov-chain-monte-carlo.html>) {#chapter-9-dot-markov-chain-monte-carlo--https-fehiepsi-dot-github-dot-io-rethinking-numpyro-09-markov-chain-monte-carlo-dot-html}


## [Chapter 10. Big Entropy and the Generalized Linear Model](<https://fehiepsi.github.io/rethinking-numpyro/10-big-entropy-and-the-generalized-linear-model.html>) {#chapter-10-dot-big-entropy-and-the-generalized-linear-model--https-fehiepsi-dot-github-dot-io-rethinking-numpyro-10-big-entropy-and-the-generalized-linear-model-dot-html}


## [Chapter 11. God Spiked the Integers](<https://fehiepsi.github.io/rethinking-numpyro/11-god-spiked-the-integers.html>) {#chapter-11-dot-god-spiked-the-integers--https-fehiepsi-dot-github-dot-io-rethinking-numpyro-11-god-spiked-the-integers-dot-html}


## [Chapter 12. Monsters and Mixtures](<https://fehiepsi.github.io/rethinking-numpyro/12-monsters-and-mixtures.html>) {#chapter-12-dot-monsters-and-mixtures--https-fehiepsi-dot-github-dot-io-rethinking-numpyro-12-monsters-and-mixtures-dot-html}


## [Chapter 13. Models With Memory](<https://fehiepsi.github.io/rethinking-numpyro/13-models-with-memory.html>) {#chapter-13-dot-models-with-memory--https-fehiepsi-dot-github-dot-io-rethinking-numpyro-13-models-with-memory-dot-html}


## [Chapter 14. Adventures in Covariance](<https://fehiepsi.github.io/rethinking-numpyro/14-adventures-in-covariance.html>) {#chapter-14-dot-adventures-in-covariance--https-fehiepsi-dot-github-dot-io-rethinking-numpyro-14-adventures-in-covariance-dot-html}


## [Chapter 15. Missing Data and Other Opportunities](<https://fehiepsi.github.io/rethinking-numpyro/15-missing-data-and-other-opportunities.html>) {#chapter-15-dot-missing-data-and-other-opportunities--https-fehiepsi-dot-github-dot-io-rethinking-numpyro-15-missing-data-and-other-opportunities-dot-html}


## [Chapter 16. Generalized Linear Madness](<https://fehiepsi.github.io/rethinking-numpyro/16-generalized-linear-madness.html>) {#chapter-16-dot-generalized-linear-madness--https-fehiepsi-dot-github-dot-io-rethinking-numpyro-16-generalized-linear-madness-dot-html}


## [Chapter 17. Horoscopes](<https://fehiepsi.github.io/rethinking-numpyro/17-horoscopes.html>) {#chapter-17-dot-horoscopes--https-fehiepsi-dot-github-dot-io-rethinking-numpyro-17-horoscopes-dot-html}
